OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/combustion/coldEngineFoam/freePiston/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/caseSettings"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $/internalField/epsilon;

boundaryField
{
    back
    {
        type            wedge;
    }

    front
    {
        $back;
    }

    liner
    {
        $/wall/epsilon;
    }

    cylinderHead
    {
        $liner;
    }

    piston
    {
        $liner;
    }
}

#remove (wall piston)

// ************************************************************************* //
